<?php
  // 'Hello, world!'をechoしてください
  echo 'Hello, world!';
?>

<?php
  // 7 * 2をechoしてください
  echo 7 * 2;
?>

<?php
  // 8 % 3をechoしてください
  echo 8 % 3;
?>

<!-- この下で5 + 7を出力しましょう -->
<?php
  echo 5 + 7;
?>

<!-- この下で'5 + 7'を出力しましょう -->
<?php
  echo '5 + 7';
?>

<!-- この下に変数$fruitを書いていきましょう！ -->
<?php
  $fruit = 'りんご';
  echo $fruit;
?>

<!-- この下に変数$sumを書いていきましょう！ -->
<?php
  $sum = 8 + 9;
  echo $sum;
?>

<?php

  $x = 5;
  $y = 2;
  $a = 8;
  $b = 4;
    
?>

<!-- この下で$xの計算をしていきましょう -->
<?php
  $x += 10;
  echo $x;
?>

<!-- この下で$yの計算をしていきましょう -->
<?php
  $y *= 5;
  echo $y;
?>

<!-- この下で$aの計算をしていきましょう -->
<?php
  $a++;
  echo $a;
?>

<!-- この下で$bの計算をしていきましょう -->
<?php
  $b--;
  echo $b;
?>